verification/runs/ansys_verification/VMFL069/L1/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2606                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          8;
        startFace       472;
    }
    upperWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          8;
        startFace       480;
    }
    periodicIn
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          32;
        startFace       488;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  periodicOut;
    }
    periodicOut
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          32;
        startFace       520;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  periodicIn;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          512;
        startFace       552;
    }
)

// ************************************************************************* //
