verification/runs/ansys_verification/VMFL069/L1/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| VMFL069 -- Two Phase Poiseuille Flow (VM2026R1 p.205). FROZEN CASE INPUT.  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// fluid1 (nu = 0.1) fills the LOWER half, 0 <= y < 2 m.
// boxToCell selects a cell when its CENTRE lies inside the box. NY is even at
// every registered level, so no cell centre lies at y = 2 exactly and the
// selection is unambiguous: exactly NX*NY/2 cells.
defaultFieldValues
(
    volScalarFieldValue alpha.fluid1 0
);

regions
(
    boxToCell
    {
        box (-1 -1 -1) (3 2 1);
        fieldValues ( volScalarFieldValue alpha.fluid1 1 );
    }
);

// ************************************************************************* //
